RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_tmra.h
/**
 *******************************************************************************
 * @file  hc32f4a0_tmra.h
 * @brief This file contains all the functions prototypes of the TMRA(TimerA)
 *        driver library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Wuze            First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32F4A0_TMRA_H__
#define __HC32F4A0_TMRA_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_TMRA
 * @{
 */

#if (DDL_TMRA_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup TMRA_Global_Types TMRA Global Types
 * @{
 */
/**
 * @brief TMRA initialization structure.
 * @note 'u32PCLKDiv', 'u32CntDir' and 'u32CntMode' are valid only when the clock source is PCLK(PCLK0 for unit1 ~ uint4. PCLK1 for unit5 ~ uint12).
 */
typedef struct
{
    uint32_t u32ClkSrc;                     /*!< Specify the counting clock source of TMRA.
                                                 This parameter can be a value of @ref TMRA_Clock_Source */
    uint32_t u32PCLKDiv;                    /*!< Specify the divider of clock source while the clock source is PCLK.
                                                 This parameter can be a value of @ref TMRA_PCLK_Divider */
    uint32_t u32CntDir;                     /*!< Specify the direction of counting.
                                                 This parameter can be a value of @ref TMRA_Count_Direction */
    uint32_t u32CntMode;                    /*!< Specify the mode of counting.
                                                 This parameter can be a value of @ref TMRA_Count_Mode */
    uint32_t u32CntOvfOp;                   /*!< Specify the operation when counting overflow/underflow.
                                                 This parameter can be a value of @ref TMRA_Count_Overflow_Operation */
    uint32_t u32PeriodVal;                  /*!< Specify the period reference value.
                                                 This parameter can be a number between 0U and 0xFFFFU, inclusive. */
    uint32_t u32CntVal;                     /*!< Specify the initial value of count register.
                                                 This parameter can be a number between 0U and 0xFFFFU, inclusive. */
} stc_tmra_init_t;

/**
 * @brief TMRA PWM configuration structure.
 */
typedef struct
{
    uint32_t u32StartPolarity;              /*!< Specify the polarity when the specified TMRA channel start counting.
                                                 This parameter can be a value of @ref TMRA_PWM_Start_Polarity */
    uint32_t u32StopPolarity;               /*!< Specify the polarity when the specified TMRA channel stop counting.
                                                 This parameter can be a value of @ref TMRA_PWM_Stop_Polarity */
    uint32_t u32CmpPolarity;                /*!< Specify the polarity when the specified TMRA channel counting matches the compare register.
                                                 This parameter can be a value of @ref TMRA_PWM_Match_Cmp_Polarity */
    uint32_t u32PeriodPolarity;             /*!< Specify the polarity when the specified TMRA channel counting matches the period register.
                                                 This parameter can be a value of @ref TMRA_PWM_Match_Period_Polarity */
    uint32_t u32ForcePolarity;              /*!< Specify the polarity when the specified TMRA channel at the beginning of the next cycle.
                                                 This parameter can be a value of @ref TMRA_PWM_Force_Polarity */
} stc_tmra_pwm_cfg_t;

/**
 * @brief TMRA hardware trigger condition configuration structure.
 */
typedef struct
{
    uint32_t u32StartCond;                  /*!< Specify the condition to start the specified TMRA unit.
                                                 This parameter can be a value of @ref TMRA_Hardware_Start_Condition */
    uint32_t u32StopCond;                   /*!< Specify the condition to stop the specified TMRA unit.
                                                 This parameter can be a value of @ref TMRA_Hardware_Stop_Condition */
    uint32_t u32ClrCond;                    /*!< Specify the condition to clear the specified TMRA unit's count register.
                                                 This parameter can be a value of @ref TMRA_Hardware_Clear_Condition */
} stc_tmra_trig_cond_t;

/**
 * @}
 */

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TMRA_Global_Macros TMRA Global Macros
 * @{
 */

/**
 * @defgroup TMRA_Channel TMRA Channel
 * @{
 */
#define TMRA_CH_1                           (0U)                        /*!< Channel 1 of TMRA. */
#define TMRA_CH_2                           (1U)                        /*!< Channel 2 of TMRA. */
#define TMRA_CH_3                           (2U)                        /*!< Channel 3 of TMRA. */
#define TMRA_CH_4                           (3U)                        /*!< Channel 4 of TMRA. */
/**
 * @}
 */

/**
 * @defgroup TMRA_Input_Pin TMRA Input Pin
 * @{
 */
#define TMRA_PIN_TRIG                       (1UL << 0U)                 /*!< Pin TIMA_<t>_TRIG. */
#define TMRA_PIN_CLKA                       (1UL << 1U)                 /*!< Pin TIMA_<t>_CLKA. */
#define TMRA_PIN_CLKB                       (1UL << 2U)                 /*!< Pin TIMA_<t>_CLKB. */
#define TMRA_PIN_PWM1                       (1UL << 3U)                 /*!< Pin TIMA_<t>_PWM1. */
#define TMRA_PIN_PWM2                       (1UL << 4U)                 /*!< Pin TIMA_<t>_PWM2. */
#define TMRA_PIN_PWM3                       (1UL << 5U)                 /*!< Pin TIMA_<t>_PWM3. */
#define TMRA_PIN_PWM4                       (1UL << 6U)                 /*!< Pin TIMA_<t>_PWM4. */
#define TMRA_PIN_ALL                        (TMRA_PIN_TRIG | \
                                             TMRA_PIN_CLKA | \
                                             TMRA_PIN_CLKB | \
                                             TMRA_PIN_PWM1 | \
                                             TMRA_PIN_PWM2 | \
                                             TMRA_PIN_PWM3 | \
                                             TMRA_PIN_PWM4)
/**
 * @}
 */

/**
 * @defgroup TMRA_Count_Direction TMRA Counting Direction
 * @{
 */
#define TMRA_DIR_DOWN                       (0x0U)                      /*!< TMRA count down. */
#define TMRA_DIR_UP                         (TMRA_BCSTR_DIR)            /*!< TMRA count up. */
/**
 * @}
 */

/**
 * @defgroup TMRA_Count_Mode TMRA Counting Mode
 * @{
 */
#define TMRA_MODE_SAWTOOTH                  (0x0U)                      /*!< Count mode is sawtooth wave. */
#define TMRA_MODE_TRIANGLE                  (TMRA_BCSTR_MODE)           /*!< Count mode is triangle wave. */
/**
 * @}
 */

/**
 * @defgroup TMRA_Clock_Source TMRA Counting Clock Source
 * @note PCLK is automatically disabled when other clock is selected.
 * @note Symmetric units: uint 1 and 2; uint 3 and 4; ...; uint 11 and 12.
 * @{
 */
#define TMRA_CLK_PCLK                       (0x0U)                      /*!< PCLK. PCLK0 for unit1 ~ uint4. PCLK1 for unit5 ~ uint12. */

#define TMRA_CLK_HW_UP_CLKAL_CLKBR          (1UL << 0U)                 /*!< When CLKA is low, a rising edge is sampled on CLKB, the counter register counts up. */
#define TMRA_CLK_HW_UP_CLKAL_CLKBF          (1UL << 1U)                 /*!< When CLKA is low, a falling edge is sampled on CLKB, the counter register counts up. */
#define TMRA_CLK_HW_UP_CLKAH_CLKBR          (1UL << 2U)                 /*!< When CLKA is high, a rising edge is sampled on CLKB, the counter register counts up. */
#define TMRA_CLK_HW_UP_CLKAH_CLKBF          (1UL << 3U)                 /*!< When CLKA is high, a falling edge is sampled on CLKB, the counter register counts up. */
#define TMRA_CLK_HW_UP_CLKBL_CLKAR          (1UL << 4U)                 /*!< When CLKB is low, a rising edge is sampled on CLKA, the counter register counts up. */
#define TMRA_CLK_HW_UP_CLKBL_CLKAF          (1UL << 5U)                 /*!< When CLKB is low, a falling edge is sampled on CLKA, the counter register counts up. */
#define TMRA_CLK_HW_UP_CLKBH_CLKAR          (1UL << 6U)                 /*!< When CLKB is high, a rising edge is sampled on CLKA, the counter register counts up. */
#define TMRA_CLK_HW_UP_CLKBH_CLKAF          (1UL << 7U)                 /*!< When CLKB is high, a falling edge is sampled on CLKA, the counter register counts up. */
#define TMRA_CLK_HW_UP_TRIGR                (1UL << 8U)                 /*!< When a rising edge occurred on TRIG, the counter register counts up. */
#define TMRA_CLK_HW_UP_TRIGF                (1UL << 9U)                 /*!< When a falling edge occurred on TRIG, the counter register counts up. */
#define TMRA_CLK_HW_UP_EVENT                (1UL << 10U)                /*!< When the event specified by TMRA_HTSSR occurred, the counter register counts up. */
#define TMRA_CLK_HW_UP_SYM_OVF              (1UL << 11U)                /*!< When the symmetric unit overflow, the counter register counts up. */
#define TMRA_CLK_HW_UP_SYM_UNF              (1UL << 12U)                /*!< When the symmetric unit underflow, the counter register counts up. */
#define TMRA_CLK_HW_UP_ALL                  (0x1FFFUL)

